---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Mechanical.MechanicalFitting
source: html/62cd96e1-895c-283a-c570-fa37f432b2ca.htm
---
# MechanicalFitting Members

Causes the object to release immediately any resources it may be utilizing.